[
  {
    "source": "substack",
    "title": "What are you doing for Design Week?",
    "content": "This week we’re featuring our monthly Q&A column, sharing how to get your hands on design week fun, highlighting restaurant collabs and introducing you to our cool new friends: Bob, Marjorie, Carly, Alex, and Alexa of Pinch.\nRanger Station West Village Store\nPhoto by Jake White\nNashville-based fragrance brand,\nRanger Station\n, just landed in NYC! Their new wood-paneled jewel box on Bleecker Street is opening tomorrow at 10am with a big splash – they’ll have flash tattoos, cold drinks, and a gift with every purchase. Stop by at 316 Bleecker to check it all out.\nNADC Burger\nNYC’s newest backyard burger has arrived in SoHo at 25 Cleveland Place.\nNADC (“Not a Damn Chance”) Burger\nbrings signature smash-style cheeseburgers and beef tallow fries for the first time to the East Coast. Created by an unlikely duo - professional skateboarder Neen Williams and Michelin-starred Chef Phillip Frankland Lee of\nScratch Restaurants Group\n, NADC is serving up a small menu done right. The new location will feature an expansive outdoor patio and vibrant murals by local NYC artist\nJappy Agoncillo\n.\nThese days it seems like we all know someone in New York raving about Portugal, its food and its weather – and they are totally right. The one thing some of them miss, however, is not taking a trip to Porto. A major city a few hours north of the capital city, Lisbon, Porto has a distinctly different vibe. Slightly more European, a little artsier, and FULL of independently owned shops, bars, and restaurants. Allow us to be reductive in saying that we feel confident in declaring Porto the Brooklyn of Portugal.\nWe’ve got an absolutely STACKED list of places personally vetted and approved by the two writers of this newsletter, so read along and if you appreciate these guides,\nconsider upgrading your subscription to paid\nto help us continue bringing content like this to coolstuff!\nRead the Free Porto Guide!\nWhat About Wine Talk and Taste\nNext weekend, cool friend,\nEric Do\nof\nWhat About Wine\nis hosting a very fun and very special blind wine tasting event at\nLarry’s Cà Phê\nin East Williamsburg. Eric will be bringing along six special wines for a total of 3 FULL GLASSES with each ticket. You’ll be tasting wines you know and love from Germany and France, side by side with some exciting U.S. producers from New York, Oregon and other wild-cards. All this for just $36 at a casual event for people at all levels of wine knowledge! Tickets are limited will go FAST\nso grab yours here\n!\nKREWE \"Krawfish\" Boil for a Cause\nNew Orleans based eyewear brand,\nKREWE\n, is back with their 3rd annual\nKREWE \"Krawfish\" Boil\nat the NYC flagship location in Meatpacking at 67 Gansevoort St. This unforgettable afternoon (TOMORROW from 1-6p!) will be filled with great food, live music, and community, all in support of cancer research. You can expect: over 2,000 lbs of fresh Louisiana crawfish, live performances, and a lineup of local and Southern favorites—including Crystal Hot Sauce, Abita Beer, Popeyes, PopUp Bagels, &Holiday, Figlia, Athletic Brewing, and Uplift Tattoo.\nGrab your tickets\nfor a cause now!\nMùa Xuân Cafe Pop-up\nTomorrow at\ntelos.haus\nin East Williamsburg, tatosando will be popping up for a Viet-inspired one day only event! They’ll be serving drinks like kumquat strawberry matcha and Bac Xỉu (Saigon-style coffee) alongside a selection of sweet treats and DJ sets! Come by tomorrow from 12-3 and\nRSVP here\nfor free.\nF&F Pizza Sessions\nEver dreamed of trying a slice from some of the best pizza chefs around the world? Now is your chance!! Blackbird is giving the people what they want and organized the ultimate pizza event in collaboration with Carroll Gardens’ F&F.\nBlackbird Presents: The F&F Pizza Sessions\nis happening May through August with one night only events where some of the best pizza chefs in the world are coming to cook and hang out in the Frankies garden in Carroll Gardens.\nSnag a spot\nat one of the upcoming pop-ups this summer!\ncoolstuff.nyc is a reader-supported publication. If you love reading our newsletter & want to receive two additional emails each month + lots of other cool stuff, consider becoming a paid subscriber <3\nSubscribe\nThe NYCxDESIGN Festival\nbrings together thousands of global design leaders, innovators, and enthusiasts for a week-long celebration of creativity, community, and inspiration. From Thursday, May 15th to Wednesday, May 21, New York City will be transformed into a vibrant hub of design, featuring a dynamic lineup of exciting events, talks, exhibits, and gatherings. This year’s unifying theme ‘Design is for Everyone’ exemplifies NYCxDESIGN’s commitment to inclusivity and the power of design to create a positive impact for all.\nDumbo Design Day\nBrooklyn's DUMBO is officially a design district and they're celebrating with the very first DUMBO x Design Day next Wednesday, the final day of the festival. DUMBO x Design Day festivities will include more than 20 different events throughout the day, including grand openings, studio visits, panels, book signings, a walking tour of indie design shops, a\nDUMBO x Design closing party\n, and evening art projections on the Manhattan Bridge. Make sure you get your eyes on\nthe full lineup\n!!\nAs part of DUMBO x Design Day, next Wednesday, interior designers Britt and Damian Zunino of\nStudio DB\n, Alfredo Paredes of\nAlfredo Paredes Studio\n, Barry Bordelon and Jordan Slocum of\nBrownstone Boys\n, and\nSteve Cordony\njoin\nSam Cochran\n, Global Features Director at Architectural Digest, are coming together for a\npanel discussion\nexploring the power of personal design voices and the evolving landscape of interiors. The conversation celebrates each designer’s recently published book and will be followed by a cocktail reception and book signing.\nEnso at Colbo\nItem: Enso\n- the autodidactic practice of unpolished objects, made entirely by hand from interior designers\nYuria Kailich\nand\nJoel Harding\nin NYC, will be taking over\nColbo\nnow until May 21st. The pop-up will feature its inaugural installation of furniture, lighting, and other objects like a metal table lamp and hanging painted silk pendant. Check out the pop-up & get a first glimpse of the Durian Table Lamp, part of their new collection Soft Grounds, until the 21st.\n“It All Started Here” at Coming Soon\nStarting today at their amazing Canal Street shop,\nComing Soon\nwill be celebrating the “Fish Design” collaboration between designers Andrea Corsi and the late, legendary Gaetano Pesce. The two originally met in NYC in 2003 and that’s when Pesce introduced his new friend to his completely unique and intentionally uncontrollable series of vessels, plates, clocks, and more. Coming Soon will highlight the variability in size, color, gesture, and material alongside early prototypes and videos from the Milan studio of Gaetano Pesce. The show is live now through the end of the month!\nFrama in NYC\nCPH furniture and home goods brand\nFRAMA\n, is coming to town for design week. Join them until the 22nd for two events that celebrate Sculpture Garden as a sensory respite from city life: beginning at New York institution Soho News International for a collaborative opening event with the biannual Openhouse Magazine, and continuing through the weekend at Happier Grocery.\nGet even more deets on their site\n- see you there?\nFritz Hansen\nThe longstanding Danish design giant,\nFritz Hansen\n, is activating their NYC showroom for design week in celebration of the legacy of designer Poul Kjærholm. This special exhibition highlights important pieces including two of his iconic chair designs. Stop by and see it at 22 Wooster St in Soho this design week!\nAsk us a question, recommendation, or well…anything in the comments section of the newsletter & we’ll reply within 24 hours. This is your chance for personalized NYC recommendations - from a date night spot in the West Village to the coolest shops in Cobble Hill - we’ve got you covered! All you have to do is click the comment icon at the top or bottom of this week’s newsletter to get your questions over to us :)\nSee you in the comments?\nLeave a comment\nMeet Bob (Owner + Executive Chef), Marjorie (creative director), Carly (Chief Sales Officer), Alex (Director of Booking & HR), and Alexa (Chief Events Officer) the partners of NY-based food + beverage experience company, Pinch Food Design.\nWe first became enchanted by the universe of Pinch after experiencing their “Pinch Happy Hours” and fell in love with the inspired ways they are creating catered food and serving ware that truly wows an audience. We chatted with the 5 partners of Pinch to hear how they stay true to their mission of FUN and zero waste in a busy NYC catering world.\nTell us about your playful, avant-garde catering business, Pinch Food Design!\nWe’re a New York-based chef and designer-led team reimagining what event catering can be. Our mission is to surprise and delight guests with every bite - and to craft the most exciting food experiences around.\nKnown for our playful, disruptive approach, we blur the lines between food and design, creating new ways for guests to interact with what’s on their plate (or the food hanging above their heads). We thrive on solving the food challenges that come with throwing large parties.\nOur chefs push culinary boundaries, creating bites that are stunning, delicious, edgy and interactive. Think: miniature apple tarte tatins, poached lobster served in a sardine tin, or glowing spaghetti al pomodoro at a cocktail party station. Everything is made from scratch in our Chelsea kitchen - from fresh pastas and hanging pretzels and churros, to the lime juice we squeeze daily for our cocktails.\nBut we don’t stop at the bites. Our design team invents and builds one-of-a-kind food and beverage “furniture”, all prototyped and produced in our workshop. Sustainability is at the core of everything we do. Whether in food or design, we prioritize local, responsible sourcing. We compost, we donate, and we proudly partner with organizations like Zero Foodprint and Columbia’s Earth Institute to measure and offset our carbon footprint - supporting small-scale agriculture and building toward a future where sustainability is the standard.\nAt the heart of it all is the Pinch Bunch - a passionate collective of chefs, designers, and entrepreneurs who share a deep love for food, design, and the art of entertaining. Together, we’re redefining catering - one captivating experience at a time.\nHow did each of your experiences come together to form the team that makes up Pinch Food Design?\nBob - Executive Chef & Founder\nI’ve been a catering chef since 1983, classically trained by Jean-Claude Nedelec of Glorious Food - one of the pioneers of catering in New York City. He basically invented the playbook, and most of his teachings still apply today.\nI founded Pinch in 2011 with one mission: to craft food that surprises and delights large groups of people - and gets them mingling. That’s what drives everything I do.\nMarjorie - Creative Director\nI left my job as an industrial designer in London and moved to NYC to join Pinch ten years ago - literally chasing my Food Design dreams. I’m a French native who grew up around food and always found time to cook, alongside passions for art, music, and design. In design school, I realized that I needed to work with food to be happy and stimulated.\nPinch uncovered a completely new and fascinating universe that I became obsessed with - hospitality, entertainment and the NYC scene. I’ve been diving deeper ever since, and I’ve never felt more passionate about anything. Chef Bob and I have zero limits - always looking for the next crazy challenge to take on.\nCarly - Chief Sales Officer\nI’ve always been obsessed with making people happy - yes, yes, it’s a conversation I need to pursue with a therapist, but it’s also what makes me really good at what I do here at Pinch. I started in custom service and hospitality when I was ten years old, working the desk at my family’s hardware store. There is where I learned that every customer (or client) has a unique set of needs, and if I can get the formula just right for how to solve their problem du jour, they’ll keep coming back.\nAlex - People Operations\nI’ve been with Pinch for so long, (all my 20’s!!) I was an intern working in the Sales department and then recruited into the Booking department and never left (except for my one year stint) and I brought back with me a fresh perspective and evolved leadership skills. When you are with a company for so long, there is comfort in shaping the culture, and if you leave and have a chance to return there is spiritedness in elevating it. My education is having first hand experience with a young company that isn't so young anymore. Working through all of the iterations of Pinch throughout the years have only made the team bigger and better!\nAlexa - Chief Events Officer\nI’m a production guru, selling and producing gatherings of every kind for over ten years. Writing a proposal for a four-day event, on three separate floors, with multiple different groups of guests truly excites me! My brain works on a large scale, so I have the unique ability to help a client understand the exact needs of their event.\nHaving worked at Pinch, I like to say I’ve seen it all and nothing surprises me. I know how hard this biz can be, so with Pinch I get to “take on the stress and logistics”, so that you can have the most fun experience possible.\nWhat’s your favorite part about the New York culinary and event community?\nAlexa\nThe event industry is very small: everyone knows everyone, who knows someone, who knows you! You’re always seeing a familiar face, and figuring out when your paths have crossed. Both my sister and my cousins are in the industry, so my favorite part is how it truly feels like a family.\nBob\nThe ideas are so innovative and rampant. This place is so multicultural and open to experimentation. Everyone here is open to a new experience, in fact they crave new experiences. We all have our “New York face”, which for some is not a smile, so the goal is to always make someone smile when they experience any aspect of Pinch Food Design.\nMarjorie\nOne of the best parts of New York’s culinary and events scene is our incredible freelance team - 350+ talented individuals, many of whom come from the arts. From Broadway performers, writers, dancers, actors, and singers to chefs and entrepreneurs, everyone brings their own unique NY story to the table. There is definitely a theater and performance aspect in what Pinch does, which works so well with this creative community.\nCarly\nI love how the “we’re all in this together” (sung in the tune of High School Musical duh) mentality is the rule vs. the exception in the New York market. Yes, being surrounded by the best creates some healthy competition, but if anything, it pushes us to be better than we were yesterday, and that can only create upward momentum for us all. If you come to our city and are a jerk, “you can’t sit with us” period.\nAlex\nIf you are working in NYC, people are moving quickly, speaking quickly, all things quickly... you know. However, it is an amazing experience to be amongst others who are the creme de la creme in their industry, and from all different backgrounds. It is also a humbling place because you need to have drive and resilience, it is a very “work hard, play hard” mentality in NY. I work with the most talented musicians, writers, performers, etc., so some days we go see them perform on stage and then they will come straight from their performance and get right to work at one of our events.\nYour edible pieces are often inspired by art, the city, and the world around us. Can you tell us a little about the creative process at Pinch?\nMarjorie\nThe creative process at Pinch is my favorite part - because every day is a new adventure. I never know what’s coming next, but I’m always so excited to uncover it! It starts with the energy: walking into a buzzing kitchen each morning is the kind of creative fuel I dream of. Add to that the magic of living in NYC (best city) and being constantly stimulated creatively. And let’s not forget traveling (The French need their vacation!) It's a great way to learn and get inspired by other cultures.\nI’ve always loved objects, art, and architecture just as much as hosting and entertaining. For me, anything can lead to the start of a new piece: from a sample of recycled pressed paper, to finding a giant bar spoon, or even trying to solve an existing party dilemma. Take champagne towers, for example - we love its glam, New York vibes, but it’s messy and wasteful at events. That challenge led to the creation of our cocktail fountain. It’s all part of our agile process: sketch, prototype, and test. Every idea goes through multiple rounds - food trials, event runs, guest interaction, service flow - until it’s just right.\nWe’re also not afraid of things going off-script, we’re used to it! You have to enjoy the process, be ready to troubleshoot, and stay open to the unexpected. I think a lot of people would get a lot of anxiety from what we do - taking risks, like trying to figure out how to hang food over guests heads or rolling arancini down a wall, but we thrive in it!\nDo you have a favorite thing you've ever created, or a favorite event you've designed for?\nBob\nOne of my all-time favorite creations was finding a way to serve spaghetti and meatball hors d’oeuvre at a party. I’d been chasing the idea for over ten years - trying to capture the full spaghetti and meatball experience in a single bite.\nI experimented with all kinds of formats: stuffing a large rigatoni with meatballs, wrapping spaghetti around a fork with a meatball on the end - you name it. But I finally cracked it by pressing angel hair into compact logs, dressing them in a simple marinara, and topping each one with a tiny olive oil–glazed, three-meat meatball.\nSomehow, the way the angel hair is cut and compacted gives this amazing al dente bite - it really mimics the sensation of a perfect forkful of pasta. It’s nostalgic, it’s elegant, and it gets people talking - which is everything I love about food design.\nFollow along\n@pinchfooddesign\nwww.pinchfooddesign.com",
    "url": "https://coolstuffnyc.substack.com/p/what-are-you-doing-for-design-week",
    "published_date": "2025-05-16T12:55:33",
    "author": "coolstuff.nyc",
    "extracted_events": [
      {
        "title": "Ranger Station West Village Store Opening",
        "date_time": "Tomorrow at 10am",
        "location": "316 Bleecker Street, NYC",
        "description": "The opening of the new store of Nashville-based fragrance brand, Ranger Station. The opening event will feature flash tattoos, cold drinks, and a gift with every purchase.",
        "price": "Free entry",
        "category": "Shopping"
      },
      {
        "title": "NADC Burger Opening",
        "date_time": "Unavailable",
        "location": "25 Cleveland Place, SoHo, NYC",
        "description": "NYC’s newest backyard burger place, NADC Burger, is now open in SoHo. It features signature smash-style cheeseburgers and beef tallow fries.",
        "price": "Varies",
        "category": "Food"
      },
      {
        "title": "What About Wine Talk and Taste",
        "date_time": "Next weekend",
        "location": "Larry’s Cà Phê, East Williamsburg, NYC",
        "description": "A special blind wine tasting event hosted by Eric Do of What About Wine. Participants will be tasting wines from Germany, France, as well as from exciting U.S. producers.",
        "price": "$36",
        "category": "Food"
      },
      {
        "title": "KREWE 'Krawfish' Boil for a Cause",
        "date_time": "Tomorrow from 1-6pm",
        "location": "67 Gansevoort St, Meatpacking, NYC",
        "description": "An afternoon filled with great food, live music, and community, all in support of cancer research. The event will feature over 2,000 lbs of fresh Louisiana crawfish, live performances, and a lineup of local and Southern favorites.",
        "price": "Varies",
        "category": "Food"
      },
      {
        "title": "Mùa Xuân Cafe Pop-up",
        "date_time": "Tomorrow from 12-3pm",
        "location": "telos.haus, East Williamsburg, NYC",
        "description": "A Viet-inspired one day only event where drinks like kumquat strawberry matcha and Bac Xỉu (Saigon-style coffee) will be served alongside a selection of sweet treats and DJ sets.",
        "price": "Free entry",
        "category": "Food"
      },
      {
        "title": "Blackbird Presents: The F&F Pizza Sessions",
        "date_time": "May through August",
        "location": "Frankies garden, Carroll Gardens, NYC",
        "description": "An ultimate pizza event where some of the best pizza chefs in the world are coming to cook and hang out.",
        "price": "Varies",
        "category": "Food"
      },
      {
        "title": "The NYCxDESIGN Festival",
        "date_time": "Thursday, May 15th to Wednesday, May 21",
        "location": "New York City",
        "description": "A week-long celebration of creativity, community, and inspiration. The city will be transformed into a vibrant hub of design, featuring a dynamic lineup of exciting events, talks, exhibits, and gatherings.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "DUMBO x Design Day",
        "date_time": "Next Wednesday",
        "location": "DUMBO, Brooklyn, NYC",
        "description": "The very first DUMBO x Design Day celebrating DUMBO as a design district. Festivities will include more than 20 different events throughout the day, including grand openings, studio visits, panels, book signings, a walking tour of indie design shops, a DUMBO x Design closing party, and evening art projections on the Manhattan Bridge.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "Enso at Colbo",
        "date_time": "Now until May 21st",
        "location": "Colbo, NYC",
        "description": "Enso, the autodidactic practice of unpolished objects, made entirely by hand from interior designers Yuria Kailich and Joel Harding in NYC, will be taking over Colbo with its inaugural installation of furniture, lighting, and other objects.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "“It All Started Here” at Coming Soon",
        "date_time": "Now through the end of the month",
        "location": "Coming Soon, Canal Street shop, NYC",
        "description": "Coming Soon will be celebrating the “Fish Design” collaboration between designers Andrea Corsi and the late, legendary Gaetano Pesce. The show will highlight the variability in size, color, gesture, and material alongside early prototypes and videos from the Milan studio of Gaetano Pesce.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "Frama in NYC",
        "date_time": "Until the 22nd",
        "location": "Soho News International and Happier Grocery, NYC",
        "description": "Frama, a furniture and home goods brand from Copenhagen, is coming to town for design week. Join them for two events that celebrate Sculpture Garden as a sensory respite from city life.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "Fritz Hansen Showroom Activation",
        "date_time": "This design week",
        "location": "22 Wooster St in Soho, NYC",
        "description": "Fritz Hansen, the longstanding Danish design giant, is activating their NYC showroom for design week in celebration of the legacy of designer Poul Kjærholm. This special exhibition highlights important pieces including two of his iconic chair designs.",
        "price": "Free entry",
        "category": "Art"
      }
    ],
    "gpt4_raw": [
      {
        "title": "Ranger Station West Village Store Opening",
        "date_time": "Tomorrow at 10am",
        "location": "316 Bleecker Street, NYC",
        "description": "The opening of the new store of Nashville-based fragrance brand, Ranger Station. The opening event will feature flash tattoos, cold drinks, and a gift with every purchase.",
        "price": "Free entry",
        "category": "Shopping"
      },
      {
        "title": "NADC Burger Opening",
        "date_time": "Unavailable",
        "location": "25 Cleveland Place, SoHo, NYC",
        "description": "NYC’s newest backyard burger place, NADC Burger, is now open in SoHo. It features signature smash-style cheeseburgers and beef tallow fries.",
        "price": "Varies",
        "category": "Food"
      },
      {
        "title": "What About Wine Talk and Taste",
        "date_time": "Next weekend",
        "location": "Larry’s Cà Phê, East Williamsburg, NYC",
        "description": "A special blind wine tasting event hosted by Eric Do of What About Wine. Participants will be tasting wines from Germany, France, as well as from exciting U.S. producers.",
        "price": "$36",
        "category": "Food"
      },
      {
        "title": "KREWE 'Krawfish' Boil for a Cause",
        "date_time": "Tomorrow from 1-6pm",
        "location": "67 Gansevoort St, Meatpacking, NYC",
        "description": "An afternoon filled with great food, live music, and community, all in support of cancer research. The event will feature over 2,000 lbs of fresh Louisiana crawfish, live performances, and a lineup of local and Southern favorites.",
        "price": "Varies",
        "category": "Food"
      },
      {
        "title": "Mùa Xuân Cafe Pop-up",
        "date_time": "Tomorrow from 12-3pm",
        "location": "telos.haus, East Williamsburg, NYC",
        "description": "A Viet-inspired one day only event where drinks like kumquat strawberry matcha and Bac Xỉu (Saigon-style coffee) will be served alongside a selection of sweet treats and DJ sets.",
        "price": "Free entry",
        "category": "Food"
      },
      {
        "title": "Blackbird Presents: The F&F Pizza Sessions",
        "date_time": "May through August",
        "location": "Frankies garden, Carroll Gardens, NYC",
        "description": "An ultimate pizza event where some of the best pizza chefs in the world are coming to cook and hang out.",
        "price": "Varies",
        "category": "Food"
      },
      {
        "title": "The NYCxDESIGN Festival",
        "date_time": "Thursday, May 15th to Wednesday, May 21",
        "location": "New York City",
        "description": "A week-long celebration of creativity, community, and inspiration. The city will be transformed into a vibrant hub of design, featuring a dynamic lineup of exciting events, talks, exhibits, and gatherings.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "DUMBO x Design Day",
        "date_time": "Next Wednesday",
        "location": "DUMBO, Brooklyn, NYC",
        "description": "The very first DUMBO x Design Day celebrating DUMBO as a design district. Festivities will include more than 20 different events throughout the day, including grand openings, studio visits, panels, book signings, a walking tour of indie design shops, a DUMBO x Design closing party, and evening art projections on the Manhattan Bridge.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "Enso at Colbo",
        "date_time": "Now until May 21st",
        "location": "Colbo, NYC",
        "description": "Enso, the autodidactic practice of unpolished objects, made entirely by hand from interior designers Yuria Kailich and Joel Harding in NYC, will be taking over Colbo with its inaugural installation of furniture, lighting, and other objects.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "“It All Started Here” at Coming Soon",
        "date_time": "Now through the end of the month",
        "location": "Coming Soon, Canal Street shop, NYC",
        "description": "Coming Soon will be celebrating the “Fish Design” collaboration between designers Andrea Corsi and the late, legendary Gaetano Pesce. The show will highlight the variability in size, color, gesture, and material alongside early prototypes and videos from the Milan studio of Gaetano Pesce.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "Frama in NYC",
        "date_time": "Until the 22nd",
        "location": "Soho News International and Happier Grocery, NYC",
        "description": "Frama, a furniture and home goods brand from Copenhagen, is coming to town for design week. Join them for two events that celebrate Sculpture Garden as a sensory respite from city life.",
        "price": "Varies",
        "category": "Art"
      },
      {
        "title": "Fritz Hansen Showroom Activation",
        "date_time": "This design week",
        "location": "22 Wooster St in Soho, NYC",
        "description": "Fritz Hansen, the longstanding Danish design giant, is activating their NYC showroom for design week in celebration of the legacy of designer Poul Kjærholm. This special exhibition highlights important pieces including two of his iconic chair designs.",
        "price": "Free entry",
        "category": "Art"
      }
    ]
  },
  {
    "source": "blog",
    "title": "★★★★★ “A RICH TAPESTRY OF EMOTIONAL AND PSYCHOLOGICAL TENSION!” – THEATRE WEEKLY (SPONSORED)",
    "content": "Photo: Craig Lomas\nRichard Jordan Productions and 412\nWith Lawrence Batley Theatre, Harrogate Theatre, in association with Pleasance\npresents\nShellshocked\nWritten and directed by Philip Stokes\nStarring Lee Bainbridge and Jack Stokes\nA heroic, young, and shellshocked soldier, Wesley Hepton returns home from the trenches. To help support the family, his mother submits his art portfolio to painter Mr. Lupine. Wesley attends an interview to become his apprentice. But on arrival, he encounters another kind of madness that threatens to push him to destruction as he discovers the ulterior motives behind the artist’s palette.\nOne of The Scotsman’s “Top Five Shows to See at the Edinburgh Fringe,” Shellshocked is a thrilling study of heroism versus cowardice.\nUse code SKINT to snag $19 tickets* (reg. $44)!\nValid for all performances\nPerformances: May 14 – June 8, Tues-Fri 7:15; Sat 2:15 & 7:15; Sun 2:15. \nCLICK HERE FOR MORE INFO\n59E59 Theaters – a quick block from SUBWAY 4/5/6 N/W/R at 59 St.\n*Standard service fees apply to all phone/internet orders. Listed price is inclusive of all fees. Limit 4 tickets per order. All offers subject to availability. This offer may be revoked or modified at any time without notice. Not valid with any other offer.\nsponsored post",
    "url": "https://theskint.com",
    "published_date": null,
    "extracted_events": [
      {
        "title": "Shellshocked",
        "date_time": "2019-05-14T19:15:00Z to 2019-06-08T19:15:00Z",
        "location": "59E59 Theaters, New York",
        "description": "A heroic, young, and shellshocked soldier, Wesley Hepton returns home from the trenches. To help support the family, his mother submits his art portfolio to painter Mr. Lupine. Wesley attends an interview to become his apprentice. But on arrival, he encounters another kind of madness that threatens to push him to destruction as he discovers the ulterior motives behind the artist’s palette.",
        "price": "$19 with code SKINT (reg. $44)",
        "category": "Art/Theatre"
      }
    ],
    "gpt4_raw": [
      {
        "title": "Shellshocked",
        "date_time": "2019-05-14T19:15:00Z to 2019-06-08T19:15:00Z",
        "location": "59E59 Theaters, New York",
        "description": "A heroic, young, and shellshocked soldier, Wesley Hepton returns home from the trenches. To help support the family, his mother submits his art portfolio to painter Mr. Lupine. Wesley attends an interview to become his apprentice. But on arrival, he encounters another kind of madness that threatens to push him to destruction as he discovers the ulterior motives behind the artist’s palette.",
        "price": "$19 with code SKINT (reg. $44)",
        "category": "Art/Theatre"
      }
    ]
  },
  {
    "source": "blog",
    "title": "FRI-MON, 5/16-19: SKINT WEEKEND",
    "content": "cultural fests / street fairs / food events / markets / shopping events (free admission, unless noted otherwise): \n► fri-sun (fri 1-6pm, sat 11am-6pm, sun 11am-5pm): manhattan vintage clothing show: metropolitan pavilion (chelsea). $20 general, $15 students. >>\n► fri-sun: 49th annual saint george’s seventh street ukrainian festival: east 7th street bet 2nd + 3rd aves (east village). >>\n► sat 10am-5pm: metropolitan postcard club show + sale: church of the village (greenwich village). $3 admission. >>\n► sat 10am-6pm: annual murray hill park avenue day: park ave bet 34th + 39th streets. >>\n► sat 10am-6pm: annual graham avenue fiesta: graham avenue (ave of puerto rico) from boerum st to broadway (east williamsburg). >>\n► sat 11am-3pm: annual harlem wellness festival: marcus garvey park. >>\n► sat 12pm: annual turkish american festival parade: madison ave from 38th st to 25th st. >>\n► sat 12-5pm (monthly thru december): queens craft brigade: katch gastropub (astoria). >>\n► sat 12-7pm: 19th annual dance parade + festival: 17th st + avenue of the americas to west 8th street, thru st. marks place to tompkins square park. >>\n► sat + sun (10am-6pm): 50th annual ninth avenue international food festival: ninth avenue between 42nd + 57th streets (hell’s kitchen). >>\n► sat + sun (11am-6pm): fad market: nycxdesign pop-up market: st. paul’s church (boerum hill/cobble hill). >>\n► sun 10am-3pm: annual brooklyn grange and city growers’ plant sale + family farm day: brooklyn grange (sunset park). >>\n► sun 10am-5pm: rugged + riveted: the denim + indigo bazaar at grand bazaar nyc: indoors and outdoors at 100 w 77th st at columbus ave (uws). >>\n► sun 10am-6pm: annual fabulous fifth avenue fair: fifth avenue from sterling street to 12th street (park slope). >>\n► sun 10am-6pm (+ various dates thru the season): japan fes japanese food festival: fifth avenue bet 13th-14th street in park slope, brooklyn (note: this is a section of the fabulous fifth avenue fair). >>\n► sun 10am-6pm (monthly thru 9/6): korea fest: greenpoint ave bet 47th + 48th sts in sunnyside, queens. >>\n► sun 11am: nepal day parade: madison ave from 38th st to 24th st. >>\n► sun 11am-3pm (rain date 5/25): annual mmpcia stoop sale: mount morris park historic district (central harlem). >>\n► sun 11am-6pm: annual hoboken spring arts + music festival: washington street bet. observer highway + 7th street (hoboken, nj) >>\n► sun 11am-6pm: philippines fest presents: ubeland new york: fifth avenue bet 10th-11th street in park slope, brooklyn (note: this is a section of the fabulous fifth avenue fair). >>\n► sun 1:30pm: 71st 17th of may norwegian american day parade: bay ridge. >>\n► sun 2-7pm: academy records + friends record fair: union pool (williamsburg). >>\n► mon thru 5/24: chinatown restaurant week: 18 participating restaurants. >>\n\n\n\nsee all the art and design at these exhibitions and events (free admission, unless noted otherwise): \n► fri 4-7pm: the new school’s end-of-year print show: l2 open work space (greenwich village). free admission. >>\n► fri thru sun: ridgewood open studios: opening kickoff and after party friday, open studios sat + sun. free admission. >>\n► fri thru ? (fridays-sundays 11am-6pm): mmuseumm new exhibit: 4 cortlandt alley (tribeca). >>\n► sat 10am-6pm: madison avenue spring gallery walk: participating galleries on madison avenue and side streets from east 57th st to east 86th st. >>\n► sat 12-6pm: industry city open studios >>\n► sat + sun (12-6pm): lic arts open studios >>\n► sun 12-6pm: mana contemporary jersey city spring open studios >>\n► mon + tues (6-8pm): new york school of interior design: bfa thesis exhibition (mon, upper east side) and mfa thesis and mps studio projects exhibition (tues, nomad). >>\n► thru 5/21: nycxdesign festival: various locations and prices. >>\n\n\n\nfilm fests / series: \n► fri 12pm-8pm: annual sva bfa animation celebration screening: sva theatre (chelsea) and online. free admission. >>\n► fri thru 5/29: jack lemmon 100: the apartment, the odd couple, glengarry glen ross, grumpy old men, some like it hot, and more. film forum (south village), $17. >>\n► fri thru 6/29: hitch! the original cinema influencer: 30+ films by alfred hitchcock, a dozen hitchcockian classics by other directors, plus documentaries, shorts, and more. paris theater (midtown). $17 general, $15 seniors / students / people with disabilities / military / first responders. >>\n► sat 2-8pm: fourth annual sva masters in film directing apple box short film festival: sva theatre (chelsea). free admission. >>\n► sat 7pm: changing minds young filmmaker festival: village east by aangelika. $10. >>\n\n\n\nfriday\nsponsored fri thru sun: get insider access to the city’s best secrets this weekend with new york adventure club! explore the society of illustrators, go inside the little red lighthouse, explore grand central terminal, discover downtown manhattan’s subway history, go on a secret eats of arthur avenue or chinatown food crawl, enjoy secret parlor jazz with a bbq dinner, and more! or, head to lyndhurst mansion or the seaside village of city island. adventure awaits! >>\nsponsored: fri + sat (8pm, 9:30pm, 11pm): this weekend at flop house comedy club: amber singletary (hbo), caitlin reese (hbo), graham kay (the tonight show), brittany carney (comedy central), tatiana frank (don’t tell), demetrius fields (tik tok), jake velazquez, mia wilson, and ronnie lordi. nyc’s friendliest indie comedy club, with great comics, a cozy atmosphere, and no drink minimums—right in the heart of williamsburg. use promo code ‘skint’ to save 33% on tickets! >>\nfri various times (weather permitting): free outdoor movies: \ndespicable me at twenty-four sycamores park (lenox hill) >>\ninside out 2 at lawn area in commodore barry park (fort greene) >>\nwicked at hudson yards public square and gardens >>\nfri 5-10pm: decade downtown dance party: as part of the whitney free friday nights programming and decade downtown celebration, the meatpacking district museum hosts a dance party paying tribute to three decades of club music and culture with dj justin strauss and dj shannon. free admission (ticket reservation required). >>\nfri 6:30pm: brooklyn poets spring workshop showcase: teachers and students from brooklyn poets’ spring workshops share their work during an evening of readings at the organization’s home base in brooklyn heights. doors open at 6pm for a reception. free admission. >>\nfri 7pm (monthly): kweendom: come out for the kweendom lgbtq+ comedy and storytelling show, featuring performances by ben hawes, justin alicastro, chloe cunha, riylan mills, and kendra dawsey. pete’s candy store (williamsburg), free admission (donations are welcome and will benefit the here to pee tour). >>\nfri 7pm: ¡vaya! latin music series: mambo legends orchestra: the grammy-nominated, 21-piece mambo legends orchestra comes to lincoln center’s david rubenstein atrium (uws) for an evening of music and dancing. free admission. >>\nfri 7:30pm: the story collider podcast’s science storytelling show: ‘revelation’: storytellers share true, personal stories about science on the theme of revelation at the latest edition of the story collidershow. hosted by julio chávez and tracey segarra. qed (astoria), $15. >>\nfri 7:30pm: defector media presents ten minute quarters: a wnba comedy show: join other wnba fans for a night of stand up, games, giveaways, and special guests to get you hyped for saturday’s new york liberty season opener. hosted by nora jefferies and jasper wang. littlefield (gowanus), $14.31+ with promo code ‘skintwnba’ (reg. $18.67+). >>\nfri 7:30pm doors (monthly): best night ever comedy show: audrey black and akshay sampath (cracked) host a night of stand-up at el santo taqueria (east williamsburg / bushwick). tonight: andy haynes (snl), joey dardano (wild n out), zubi ahmed (ramy), geoffrey asmus, divya gunasekaran, and alex boswell. $12.51 adv, $16+ day of. >>\nfri 7:45pm doors (thru august and beyond): rooftop films summer series: the popular rooftop films series, one of the word’s longest-running and largest outdoor showcases for indie film, returns for its 29th season. the summer series includes over 40 free and ticketed events across nyc, featuring new independent feature films, short film programs, family screenings, and live performances. tonight’s season opener: ‘this is what we mean by short films,’ plus live music from gold casio, filmmaker q+a, and an after-party. green-wood cemetery, $20. >>\nfri 8pm: laugh it off: bring your problems to the laugh it off show, where audience members submit their everyday problems and comedians try their best to ‘fix’ them. boyb. melrose podcasts (east village), $16. >>\nfri 8:30pm: bitches brew comedy show: this women-produced and-hosted comedy show conjures up big laughs in the back room of halyards (gowanus). tonight’s performers include caitlin reese (hbo), mycal dede (don’t tell comedy), dan carney (run club), elle orlando (@_elleorlando_), alex castagne, and dwayne paul cullen. free admission (a tip jar will be passed around at the end of the show). >>\nfri 9:30pm: would you rather? comedy show: hosts maggie maxwell and andre medrano ask comedians to make tough choices at the would you rather show. featuring nonye brown-west (npr), anthony devito (colbert), jacob williams (colbert), and anna roisman (mtv). caveat (les), $15 adv, $20 door. >>\nfri 10pm: sade night: smooth operators and soldiers of love make their way to the long-running sade night new york city party. the onyx room at house of yes (bushwick), $10.30. >>\nsaturday\nsat (various times): eurovision song contest finale viewing parties: \n► brooklyn art haus (williamsburg): $10 admission. >>\n► footlight underground at the windjammer (ridgewood) >>\n► hardware bar (hell’s kitchen) >>\n► rise bar (hell’s kitchen) >>\n► q.e.d. (astoria): $10 admission. >>\n► the liberty nyc (midtown west) >>\nsat + sun (various times): 15th annual sacred sites open house: the new york landmarks conservancy presents its annual sacred sites open house, a weekend when more 60 congregations across the city and state open their doors for guided and self-guided tours, lectures, and musical performances celebrating their architecture and history. free admission. >>\nsat + sun (sat 11am-2:30pm, sun 11am-2:30pm): free bike helmets: the department of transportation continues its bike helmet distribution program this weekend, offering free, personally-fitted helmets at juniper valley park in middle village, queens (sat) and tecumseh playground on the upper west side (sun) while supplies last. can’t make it? more dates and locations should be announced periodically through summer. >>\nsat + sun (sat 2:15pm + 7:30pm, sun 3pm): how the land lies at governors island: as part of the inter­ven­tions mul­ti­dis­ci­pli­nary per­for­mance series, gov­er­nors island arts presents how the land lies, an outdoor performance piece incorporating movement and scrolling led signs that explore how language influences mobility. direct­ed and chore­o­graphed by lau­ra cemin (italy/​finland) and bian­ca hisse (brazil/​norway). free sat 2:15pm; 2-for-1 tickets available for $20 sat 7:30pm + sun 3pm. >>\nsat various times (weather permitting): free outdoor movies: \nking richard at lincoln terrace park (crown heights) >>\nwicked at renaissance playground (harlem) >>\nsat (waves start at 7am, 7:15am, 7:40am, and 8:05am): rbc brooklyn half marathon: cheer on thousands of runners as they race 13.1 miles from the brooklyn museum, through prospect park, down ocean parkway, and across the finish line on the coney island boardwalk. >>\nsat 11am-3pm: kite festival: queue up the mary poppins soundtrack for brooklyn bridge park’s annual kite festival at pier 5—the only day of year when kite flying is open to the public in the park. bring your own kite, purchase, or make one on site. kites are $10-30, admission is free. >>\nsat 11am-4pm: governors island arts season launch party: gov­er­nors island arts sea­son kicks off with a free, all-ages launch par­ty featuring a dj set by miss alicia, outdoor performances and activations, guided exhibit tours of an island-wide group show, artmaking activities for all ages by red hook art project, and more. food and drinks will be available for purchase. free admission. >>\nsat 3pm (season finale): washington heights chamber orchestra: ‘landscapes’: washington heights chamber orchestra wraps the season with a program that pays musical homage to the distant lands that are a part of our heritage, including fela sowande’s african suite for strings and tchaikovsky’s serenade for strings. fort washington collegiate church (washington heights), $20 general, $10 seniors/students. >>\nsat 3pm (season finale): metropolitan music community spring concert: kings county concert band, grand street community band, and brooklyn wind symphony close their season with an afternoon concert showcasing a diverse range of works. grand street campus high school auditorium (east williamsburg), $10-20 general, free for students. >>\nsat 6pm (monthly): the astigmatism comedy show: a book-ish standup comedy show highlighting diversity in laughter and literature: comedians alexis bradby, kristal adams, and isabelle pierre bring together underrepresented voices in comedy and literature for ‘the tiny desk of comedy’ at p+t knitwear bookstore (les). $15 admission includes $5 that can be applied towards any purchase in the bookstore or café. >>\nsat 6:30pm: bollywood community dance: join imge dance company for a performance and community dance workshop rooted rooted in indian classical, hip-hop, and contemporary dance at battery park city’s esplanade plaza. free. >>\nsat 7pm: club video: 10th edition: micah phillips (comedy central) and whitley watson (adult swim) host a video party featuring new experimental and comedy short films from independent creators at silo (bushwick). the only rules that industry pros and first-time filmmakers had to adhere to: nothing over three minutes, and nothing that’s been screened before. stick around for an afterparty with the filmmakers and dj john swan. $15. >>\nsat 7pm (monthly): a drinking game nyc: clueless: a drinking game nyc comedy troupe lovingly (and drunkenly) reenacts an 80s/90s/00s movie and turns the whole thing into a drinking game. join them tonight as they stumble through clueless (1995) at the bell house (gowanus). $25.05. >>\nsat 7pm (season finale): the master chorale: the master chorale presents its final concert of the 2024-2025 season, featuring fauré’s requiem alongside cecilia mcdowall’s stabat mater— both with full orchestra. st. bartholomew’s church (midtown), $10. >>\nsat 7:30pm: tarot parade arcana crawl: creek to river: join in a joyful, tarot-themed night parade along and in the waterways of long island city. participants will dance and play, accompanied by live music and hundreds of led-lit, hand-held bamboo and paper sculptures. meet up early (2-6:30pm) for last-minute costume-making. free. >>\nsat 8pm: fun gutter: punks and punchlines meet at fungutter, a stand-up comedy show with a punk house band. tonight’s show, hosted by sasha von didkovsky and caleb clark, features standup from tommy bayer and rylan sylvester, a comic reading by cartoonist alex krokus, and musical comedy from josh nasser. the cobra club (bushwick), free admission. >>\nsat 8pm (season finale): new york repertory orchestra 2024-25 season: the all-volunteer, community-based orchestra is back with a new season of concerts, concluding tonight with a program that includes works by aaron copland, katie jenkins, and carl nielsen. the church of st. mary the virgin (theater district), free ($15 suggested donation). >>\nsat 8pm: pataphysics audiovisual concert series: sink into a multi-sensory scene at the latest installment of delight factory’s bi-monthly pataphysics audiovisual concert series, pairing ambient and downtempo music and visuals by ezekiel honig, todd polenberg, joshue ott, and sean smith. delight factory (ocean hill), $20. >>\nsat 10pm: meat cats comedy presents: sunday sauce: whet your appetite for absurdity at britt migs and irina chelidze’s comedy show, serving up snackable stand-up by geoffrey asmus, amber singletary, j.p. mcdade, julia desmond, karthik raj, and alex babbitt. union hall (park slope), $12 adv, $15 door. >>\nsunday\nsun thru 6/15 (sundays at 6pm): music in a garden: the annual music in a garden concert series returns to the west side community garden, offering early-evening performances in a flower-filled oasis. expect an eclectic lineup—from classical and spanish guitar to afro-cuban and moz-jazz—all in an intimate outdoor setting. west side community garden (uws), free admission (donations welcome). >>\nsun 8am: 40th annual aids walk new york (8:30am sign-in opens, 9am dance warm-up and opening ceremony, 10am walk): join thousands for the 40th annual aids walk new york, the world’s largest and most visible hiv/aids fundraising event. the walk loops through central park in support of gmhc and public health organizations in the tri-state area, and is free to participate (no fundraising minimum required). rain or shine. >>\nsun 11am: the branches journal spring release party: the branches, a new journal of literature and philosophy, celebrates the release of its spring 2025 issue with readings from featured authors, discussion, and a potluck picnic in central park. free admission. >>\nsun 1-4pm: brooklyn books and boos: brooklyn horror society and twisted spine books team up for an afternoon of horror readings by nine authors at wild east brewing co. (gowanus). free admission (books will be available for purchase). >>\nsun 2pm: sixth annual poets afloat: after spending time writing poetry during micro-residencies on ships around new york harbor, a crew of seven local poets come together for a waterfront afternoon of readings on the deck of the south street seaport museum’s permanently-moored 1885 tall ship, wavertree. donation-based admission. >>\nsun 7pm: say less: a too truthful comedy show: buckle up for an evening of overly personal jokes and stories scored by a live band at the say less comedy show. hosted by niccolo aeed and shem pennant. ucb (east village), $15 adv, $20 day of. >>\nsun 8pm (monthly): beanie babe comedy: the standups and the stuffed animals are full of beans at this comedy show, where a donation will get you a vintage beanie baby to take home. featuring jared waters, kelly bachman, rene fuentes, amanda gram, abd benedict + florentine. hosted by rebecca kaplan. young ethel’s (south slope), free admission (donations optional). >>\nsun 8pm (monthly) disasterpiece movie night: empire of the dark: from the weird to the wondrous, disasterpiece unearths bad movies for a watch party complete with drinking games, trivia, pizza, and more. tonight: 1991 satanic panic action movie, empire of the dark. wonderville (bushwick), free admission. >>\nsun 9pm (monthly): you are not alone: an uplifting show about depression: improvisers and artists that battle depression and mental illness in their day-to-day lives create scenes inspired by personal experiences, showing how laughter can be the best medicine. hosted by aaron gold and michael serpe. magnet theater (chelsea), $10. >>\nmonday\nmon + tues (5:30pm): american symphony orchestra chamber series at bryant park: american symphony orchestra presents its annual series of outdoor concerts on the upper terrace of bryant park. this week’s program: salon 1898: cuban dance music at the turn of the twentieth century. free admission. >>\nmon 6pm (season finale): miller theater’s pop-up concert series: the columbia university school of the arts’s musical happy hour returns for a new season of hour-long concerts where the audience is permitted to sit onstage with the performers and enjoy a free drink. tonight: harpist parker ramsay and arnie tanimoto, the first-ever viola da gamba major at the juilliard school, present a collection of baroque works, composers, and genres that influenced j.s. bach. columbia university’s miller theatre (morningside heights), free admission. >>\nmon 7pm (monthly): and scene: anything could happen when actors and improvisors share the stage at ‘and scene,’ where the actors know their lines ahead of time and the improvisers make up their parts with no prior knowledge of the scenes. featuring josh sharp (jared + ivanka), maris brau (law + order: svu), connor ratliff (the george lucas talk show), anthony atamanuik (what we do in the shadows), and more. hosted by mick szal. $18.76 with promo code ‘brick’ (reg. $24-25). >>\nmon 7:30pm: dirty little secrets improv show: see your secrets turned into comedy gold at the dirty little secrets show, where your anonymously-submitted confessions serve as inspiration for improv performers. the wara theatre (east village), $14.61 with promo code ‘skintsecrets’ (reg. $23.18). >>\nmon 7:30pm: not a boy, not a girl comedy show: two-year anniversary: will morrison hosts this comedy show outside of the gender binary, returning to crystal lake (williamsburg) with standup by deanne smith, mila myles, erica green, lou gonzalez, jr., and mateo rodriguez-hurtado, plus a drag performance by virgo rising. $10. >>\nmon 7:30pm (season finale): music mondays concert series: the music mondays concert series returns for its 22nd season presenting dynamic lineups of classical and contemporary chamber music ensembles at advent lutheran church (uws). tonight: claremont trio and metropolitan opera tenor paul appleby present a program featuring works by fauré, schubert, and jessica meyer. a casual reception will follow the performance. free admission (note: if reservations are sold out, there will be a standby line at the performance). >>\nongoing\nour roundup of 60+ ongoing events and attractions: rooftop cinema club, summer on the hudson, the met fifth ave’s new roof garden commission, brooklyn cyclones baseball season, bargemusic, and more. >>\nstay safe and healthy\n– the skint",
    "url": "https://theskint.com",
    "published_date": null,
    "extracted_events": [
      {
        "title": "Manhattan Vintage Clothing Show",
        "date_time": "Friday to Sunday",
        "location": "Metropolitan Pavilion (Chelsea)",
        "description": "A clothing show where you can purchase vintage pieces.",
        "price": "$20 general, $15 students",
        "category": "Shopping"
      },
      {
        "title": "49th Annual Saint George’s Seventh Street Ukrainian Festival",
        "date_time": "Friday to Sunday",
        "location": "East 7th Street bet 2nd + 3rd Aves (East Village)",
        "description": "A cultural festival celebrating Ukrainian heritage.",
        "price": "N/A",
        "category": "Cultural Fest"
      },
      {
        "title": "Metropolitan Postcard Club Show + Sale",
        "date_time": "Saturday 10am-5pm",
        "location": "Church of the Village (Greenwich Village)",
        "description": "A sale and show of postcards.",
        "price": "$3",
        "category": "Shopping"
      },
      {
        "title": "Annual Murray Hill Park Avenue Day",
        "date_time": "Saturday 10am-6pm",
        "location": "Park Ave bet 34th + 39th Streets",
        "description": "An annual festival celebrating the Murray Hill neighborhood.",
        "price": "N/A",
        "category": "Street Fair"
      },
      {
        "title": "Annual Graham Avenue Fiesta",
        "date_time": "Saturday 10am-6pm",
        "location": "Graham Avenue (Ave of Puerto Rico) from Boerum St to Broadway (East Williamsburg)",
        "description": "A festival celebrating Puerto Rican culture.",
        "price": "N/A",
        "category": "Cultural Fest"
      },
      {
        "title": "Annual Harlem Wellness Festival",
        "date_time": "Saturday 11am-3pm",
        "location": "Marcus Garvey Park",
        "description": "A wellness festival promoting health and fitness.",
        "price": "N/A",
        "category": "Health & Wellness"
      },
      {
        "title": "Annual Turkish American Festival Parade",
        "date_time": "Saturday 12pm",
        "location": "Madison Ave from 38th St to 25th St",
        "description": "A parade celebrating Turkish American culture.",
        "price": "N/A",
        "category": "Parade"
      },
      {
        "title": "Queens Craft Brigade",
        "date_time": "Saturday 12-5pm (monthly thru December)",
        "location": "Katch Gastropub (Astoria)",
        "description": "A monthly market featuring local Queens crafts and goods.",
        "price": "N/A",
        "category": "Market"
      },
      {
        "title": "19th Annual Dance Parade + Festival",
        "date_time": "Saturday 12-7pm",
        "location": "17th St + Avenue of the Americas to West 8th Street, thru St. Marks Place to Tompkins Square Park",
        "description": "A parade and festival celebrating dance.",
        "price": "N/A",
        "category": "Festival"
      },
      {
        "title": "50th Annual Ninth Avenue International Food Festival",
        "date_time": "Saturday + Sunday (10am-6pm)",
        "location": "Ninth Avenue between 42nd + 57th Streets (Hell’s Kitchen)",
        "description": "A food festival featuring international cuisine.",
        "price": "N/A",
        "category": "Food"
      },
      {
        "title": "Fad Market: NYCxDesign Pop-Up Market",
        "date_time": "Saturday + Sunday (11am-6pm)",
        "location": "St. Paul’s Church (Boerum Hill/Cobble Hill)",
        "description": "A pop-up market featuring local designers.",
        "price": "N/A",
        "category": "Shopping"
      },
      {
        "title": "Annual Brooklyn Grange and City Growers’ Plant Sale + Family Farm Day",
        "date_time": "Sunday 10am-3pm",
        "location": "Brooklyn Grange (Sunset Park)",
        "description": "A plant sale and family-friendly event at Brooklyn Grange.",
        "price": "N/A",
        "category": "Shopping"
      },
      {
        "title": "Rugged + Riveted: The Denim + Indigo Bazaar at Grand Bazaar NYC",
        "date_time": "Sunday 10am-5pm",
        "location": "Indoors and outdoors at 100 W 77th St at Columbus Ave (UWS)",
        "description": "A bazaar featuring denim and indigo goods.",
        "price": "N/A",
        "category": "Shopping"
      }
    ],
    "gpt4_raw": [
      {
        "title": "Manhattan Vintage Clothing Show",
        "date_time": "Friday to Sunday",
        "location": "Metropolitan Pavilion (Chelsea)",
        "description": "A clothing show where you can purchase vintage pieces.",
        "price": "$20 general, $15 students",
        "category": "Shopping"
      },
      {
        "title": "49th Annual Saint George’s Seventh Street Ukrainian Festival",
        "date_time": "Friday to Sunday",
        "location": "East 7th Street bet 2nd + 3rd Aves (East Village)",
        "description": "A cultural festival celebrating Ukrainian heritage.",
        "price": "N/A",
        "category": "Cultural Fest"
      },
      {
        "title": "Metropolitan Postcard Club Show + Sale",
        "date_time": "Saturday 10am-5pm",
        "location": "Church of the Village (Greenwich Village)",
        "description": "A sale and show of postcards.",
        "price": "$3",
        "category": "Shopping"
      },
      {
        "title": "Annual Murray Hill Park Avenue Day",
        "date_time": "Saturday 10am-6pm",
        "location": "Park Ave bet 34th + 39th Streets",
        "description": "An annual festival celebrating the Murray Hill neighborhood.",
        "price": "N/A",
        "category": "Street Fair"
      },
      {
        "title": "Annual Graham Avenue Fiesta",
        "date_time": "Saturday 10am-6pm",
        "location": "Graham Avenue (Ave of Puerto Rico) from Boerum St to Broadway (East Williamsburg)",
        "description": "A festival celebrating Puerto Rican culture.",
        "price": "N/A",
        "category": "Cultural Fest"
      },
      {
        "title": "Annual Harlem Wellness Festival",
        "date_time": "Saturday 11am-3pm",
        "location": "Marcus Garvey Park",
        "description": "A wellness festival promoting health and fitness.",
        "price": "N/A",
        "category": "Health & Wellness"
      },
      {
        "title": "Annual Turkish American Festival Parade",
        "date_time": "Saturday 12pm",
        "location": "Madison Ave from 38th St to 25th St",
        "description": "A parade celebrating Turkish American culture.",
        "price": "N/A",
        "category": "Parade"
      },
      {
        "title": "Queens Craft Brigade",
        "date_time": "Saturday 12-5pm (monthly thru December)",
        "location": "Katch Gastropub (Astoria)",
        "description": "A monthly market featuring local Queens crafts and goods.",
        "price": "N/A",
        "category": "Market"
      },
      {
        "title": "19th Annual Dance Parade + Festival",
        "date_time": "Saturday 12-7pm",
        "location": "17th St + Avenue of the Americas to West 8th Street, thru St. Marks Place to Tompkins Square Park",
        "description": "A parade and festival celebrating dance.",
        "price": "N/A",
        "category": "Festival"
      },
      {
        "title": "50th Annual Ninth Avenue International Food Festival",
        "date_time": "Saturday + Sunday (10am-6pm)",
        "location": "Ninth Avenue between 42nd + 57th Streets (Hell’s Kitchen)",
        "description": "A food festival featuring international cuisine.",
        "price": "N/A",
        "category": "Food"
      },
      {
        "title": "Fad Market: NYCxDesign Pop-Up Market",
        "date_time": "Saturday + Sunday (11am-6pm)",
        "location": "St. Paul’s Church (Boerum Hill/Cobble Hill)",
        "description": "A pop-up market featuring local designers.",
        "price": "N/A",
        "category": "Shopping"
      },
      {
        "title": "Annual Brooklyn Grange and City Growers’ Plant Sale + Family Farm Day",
        "date_time": "Sunday 10am-3pm",
        "location": "Brooklyn Grange (Sunset Park)",
        "description": "A plant sale and family-friendly event at Brooklyn Grange.",
        "price": "N/A",
        "category": "Shopping"
      },
      {
        "title": "Rugged + Riveted: The Denim + Indigo Bazaar at Grand Bazaar NYC",
        "date_time": "Sunday 10am-5pm",
        "location": "Indoors and outdoors at 100 W 77th St at Columbus Ave (UWS)",
        "description": "A bazaar featuring denim and indigo goods.",
        "price": "N/A",
        "category": "Shopping"
      }
    ]
  },
  {
    "source": "blog",
    "title": "GET $20 NEW DEAL TIX TO TAYLOR MAC’S PROSPEROUS FOOLS (SPONSORED)",
    "content": "Theatre for a New Audience Presents\nPROSPEROUS FOOLS\nStarring and Written by Taylor Mac\nDirected by Darko Tresnjak\nGET A NEW DEAL TICKET TO ANY PERFORMANCE FOR JUST $20!*\nIf you are 30 years old or under OR a full-time student of any age, you can purchase a $20 New Deal ticket (up to $95 value). Choose your seat, choose ticket type New Deal (change from Standard), and use promo code NEWDEALSKINT. ONE ID PER TICKET, FOR OTHER ELIGIBILITY REQUIREMENTS – SEE BELOW.\nSINGLE TICKETS AVAILABLE FOR ANYONE FOR $65** WITH CODE SKINT65!\nGET TICKETS AT TFANA.ORG\n\n\n\nWritten by and starring the MacArthur genius and incomparable force of theatrical nature Taylor Mac, Prosperous Fools, inspired by Moliere’s Le Bourgeois gentilhomme, is a brilliant and courageous exploration of philanthropy and its hypocrisies; a retooled comedy of manners for an age with no manners.\nCompany: Sierra Boggess, Kaliswa Brewster, Aerina Park DeBoer, Megumi Iwama, Taylor Mac, Jason O’Connell, Ian Paget, Jennifer Regan, Cara Seymour, Jennifer Smith, Em Stockwell\nPolonsky Shakespeare Center: 262 Ashland Place, Brooklyn, NY 11217\n\n\n\n* Each New Deal ticket holder must be 30 years of age and under, or a full-time student. A valid ID proving eligibility must be presented for each ticket purchased. IDs must be presented at entry beginning two hours prior to curtain. Failure to show proof of age or student ID will result in a surcharge for a full price ticket.\n** $65 ticket discount offer expires 6/29/2025. Full price up to $95. Subject to availability. All internet and phone orders are subject to a handling fee. The offer may be discontinued at any time. Not valid for previous purchases.\nBox Office hours are Monday–Saturday, 1–7pm and it can be reached at 646-553-3880 or tickets@TFANA.org.\nFace masks are encouraged, but not required.\nClick here to learn more about our policy on refunds and exchanges.\nDesign by Paul Davis Studio / Paige Restaino\n\n\n\nDeloitte and Bloomberg Philanthropies are the 2024-2025 Season Sponsors.\nPrincipal support for Theatre for a New Audience’s season and programs is provided by the Bay and Paul Foundations, The Jerome and Marlène Brody Foundation, the Howard Gilman Foundation, the Jerome L. Greene Foundation Fund at the New York Community Trust, The Dubose & Dorothy Heyward Memorial Fund, The Polonsky Foundation, The SHS Foundation, The Shubert Foundation, and The Thompson Family Foundation.\nTheatre for a New Audience’s season and programs are also made possible, in part, with public funds from the National Endowment for the Humanities; Shakespeare in American Communities, a program of the National Endowment for the Arts in partnership with Arts Midwest; the New York State Council on the Arts with the support of the Office of the Governor and the New York State Legislature; and the New York City Department of Cultural Affairs in partnership with the City Council.\nsponsored post",
    "url": "https://theskint.com",
    "published_date": null,
    "extracted_events": [
      {
        "title": "Theatre for a New Audience Presents PROSPEROUS FOOLS",
        "date_time": "Not Specified",
        "location": "Polonsky Shakespeare Center, 262 Ashland Place, Brooklyn, NY 11217",
        "description": "Written by and starring the MacArthur genius and incomparable force of theatrical nature Taylor Mac, Prosperous Fools, inspired by Moliere’s Le Bourgeois gentilhomme, is a brilliant and courageous exploration of philanthropy and its hypocrisies; a retooled comedy of manners for an age with no manners.",
        "price": "$20 for 30 years old or under or a full-time student of any age with promo code NEWDEALSKINT, $65 for anyone with code SKINT65",
        "category": "Art"
      }
    ],
    "gpt4_raw": [
      {
        "title": "Theatre for a New Audience Presents PROSPEROUS FOOLS",
        "date_time": "Not Specified",
        "location": "Polonsky Shakespeare Center, 262 Ashland Place, Brooklyn, NY 11217",
        "description": "Written by and starring the MacArthur genius and incomparable force of theatrical nature Taylor Mac, Prosperous Fools, inspired by Moliere’s Le Bourgeois gentilhomme, is a brilliant and courageous exploration of philanthropy and its hypocrisies; a retooled comedy of manners for an age with no manners.",
        "price": "$20 for 30 years old or under or a full-time student of any age with promo code NEWDEALSKINT, $65 for anyone with code SKINT65",
        "category": "Art"
      }
    ]
  }
]